ਅਮਿਤ_ਦੇ_ਦੋਸਤ = {"ਦਿਵਜੋਤ", "ਗੁਰਵਿੰਦਰ", "ਗੌਰਵ", "ਰਮਨ", "ਹਰਜੋਤ", "ਰੋਹਨ", "ਸਿਮਰਨ", "ਕਰਮਵੀਰ"}
ਹਰਜੋਤ_ਦੇ_ਦੋਸਤ = {"ਦਿਵਜੋਤ", "ਰਮਨ", "ਹਰਜੋਤ", "ਰੋਹਨ", "ਸਿਮਰਨ", "ਕਰਮਵੀਰ"}
ਦਿਵਜੋਤੀ_ਦੀ_ਪ੍ਰੇਮਿਕਾ = {"ਰਮਨ",}

print("ਅਮਿਤ_ਦੇ_ਦੋਸਤ:")
print(ਅਮਿਤ_ਦੇ_ਦੋਸਤ)
print()

print("ਦਿਵਜੋਤੀ_ਦੀ_ਪ੍ਰੇਮਿਕਾ:")
print(ਦਿਵਜੋਤੀ_ਦੀ_ਪ੍ਰੇਮਿਕਾ)
print()

print("ਹਰਜੋਤ_ਦੇ_ਦੋਸਤ:")
print(ਹਰਜੋਤ_ਦੇ_ਦੋਸਤ)
print()


ਨੰਬਰ1 = ਅਮਿਤ_ਦੇ_ਦੋਸਤ | ਹਰਜੋਤ_ਦੇ_ਦੋਸਤ   # union
ਨੰਬਰ2 = ਅਮਿਤ_ਦੇ_ਦੋਸਤ & ਹਰਜੋਤ_ਦੇ_ਦੋਸਤ    # intersection
ਨੰਬਰ3 = ਅਮਿਤ_ਦੇ_ਦੋਸਤ - ਹਰਜੋਤ_ਦੇ_ਦੋਸਤ    # difference

print("ਨੰਬਰ_1")
print(ਨੰਬਰ1)
print()

print("ਨੰਬਰ_2")
print(ਨੰਬਰ2)
print()

print("ਨੰਬਰ_3")
print(ਨੰਬਰ3)
print()
